src/examples/hello-ahf-nodejs/src/messages/authorization-remove.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:aut="http://arrowhead.eu/authorisation">
<soapenv:Header/>
    <soapenv:Body>
        <aut:removeAuthorisationRule>
            <name>hello-ahf</name>
            <type>_hello-s-ws-https._tcp</type>
            <distinguishedNameSuffix><replaceForCn/></distinguishedNameSuffix>
        </aut:removeAuthorisationRule>
    </soapenv:Body>
</soapenv:Envelope>